IDEA StatiCa Open Model
BeamData.RefLineInCenterOfGravity Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 The reference line of the member is in the center of gravity of the cross-section
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool RefLineInCenterOfGravity { get; set; }
Public Property RefLineInCenterOfGravity As Boolean
	Get
	Set
public:
property bool RefLineInCenterOfGravity {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace